define(function () {
    var characters = [
        {id: 1, characterName: 'Barbarian', characterDescription: 'Варварите са диви скитници, които никога не се плашат от близкия бой. Могъщи разтърсвания на земята, атаки от въздуха и перфектното владеене на бой с 2 оръжия, оставят мъртви техните врагове, а оцелелите, бягат в ужас търсещи спасение.', imageUrl: 'img/1.jpg' },
        {id: 2, characterName: 'Wizard', characterDescription: 'Магьосниците са отшелници, които използват телата си за мистериозна енергия, отличавайки се от обикновените потребители на магии. Те манипулират всички сили, за да раздробяват, изгарят и замразяват техните противници.', imageUrl: 'img/2.jpg' },
        {id: 3, characterName: 'Witch Doctor', characterDescription: 'Знахарите са духовни войни, който призовават мъртви души и пълзящи същества, да им служат. Заобграждат се със сган от зомбита и паразити и на спокойствие атакуват враговете си с експлодиращи черепи, отровни облаци и злобни проклятия. ', imageUrl: 'img/3.jpg' },
        {id: 4, characterName: 'Monk', characterDescription: 'Монасите са свещени войни, който канализират божествената сила, за да постигнат чиста и силна воля. Лечебните вълни, защитните мантри, както и божествено силните атаки, са им специалитет.', imageUrl: 'img/4.jpg' },
        {id: 5, characterName: 'Demon Hunter', characterDescription: 'Демон Хънтърите са безмилостни преследвачи, който екзекутират жертвите си с арсенал от далекобойни оръжия. Те използват лъкове, смъртоносни капани и бомби, за да могат бързо да убият създанията, които тероризират техният свят.', imageUrl: 'img/5.jpg' }
    ];

    return {
        characters: characters
    }
})